posts/ubuntu-setup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-04 Fri 20:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ubuntu Mate Setup</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ryan" />
<body class="main" TEXT="#FFFFFF" VLINK="#00FFFF" BGCOLOR="#000000" BACKGROUND="../resources/images/bgs/bgpurplecotton.gif">
<link rel="stylesheet" href="../resources/css/style.css">
<script type="text/javascript">
/*
@licstart  The following is the entire license notice for the
JavaScript code in this tag.

Copyright (C) 2012-2019 Free Software Foundation, Inc.

The JavaScript code in this tag is free software: you can
redistribute it and/or modify it under the terms of the GNU
General Public License (GNU GPL) as published by the Free Software
Foundation, either version 3 of the License, or (at your option)
any later version.  The code is distributed WITHOUT ANY WARRANTY;
without even the implied warranty of MERCHANTABILITY or FITNESS
FOR A PARTICULAR PURPOSE.  See the GNU GPL for more details.

As additional permission under GNU GPL version 3 section 7, you
may distribute non-source (e.g., minimized or compacted) forms of
that code without the copy of the GNU GPL normally required by
section 4, provided you include this license notice and a URL
through which recipients can access the Corresponding Source.


@licend  The above is the entire license notice
for the JavaScript code in this tag.
*/
<!--/*--><![CDATA[/*><!--*/
 function CodeHighlightOn(elem, id)
 {
   var target = document.getElementById(id);
   if(null != target) {
     elem.cacheClassElem = elem.className;
     elem.cacheClassTarget = target.className;
     target.className = "code-highlighted";
     elem.className   = "code-highlighted";
   }
 }
 function CodeHighlightOff(elem, id)
 {
   var target = document.getElementById(id);
   if(elem.cacheClassElem)
     elem.className = elem.cacheClassElem;
   if(elem.cacheClassTarget)
     target.className = elem.cacheClassTarget;
 }
/*]]>*///-->
</script>
</head>
<body>
<div id="content">
<h1 class="title">Ubuntu Mate Setup
<br />
<span class="subtitle"><span class="timestamp-wrapper"><span class="timestamp">[2020-12-04 Fri]</span></span></span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd4f223f">Step 1: Install Ubuntu Mate</a></li>
<li><a href="#org09a4854">Step 2: Set up ssh / git</a>
<ul>
<li><a href="#orgcc73957">Installed in this section:</a></li>
</ul>
</li>
<li><a href="#orga5860bc">Step 3: Install Packages</a>
<ul>
<li><a href="#org1c65b60">Change git and hg default editor</a></li>
<li><a href="#orgd5a6ef7">Manually get Chrome</a></li>
</ul>
</li>
<li><a href="#org49d7a78">Step 4: Sync configuration files</a></li>
<li><a href="#orgd0d54fa">Extra: Old Notes</a>
<ul>
<li><a href="#org028976a">Nvidia screen tearing fix</a></li>
<li><a href="#org65602c3">Vim-Live-Latex-Preview</a></li>
<li><a href="#org747e919">Python / Miniconda</a></li>
</ul>
</li>
<li><a href="#orgc315e67">Extra: dpkg results</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd4f223f" class="outline-2">
<h2 id="orgd4f223f">Step 1: Install Ubuntu Mate</h2>
<div class="outline-text-2" id="text-orgd4f223f">
<p>
Most recently (as of <span class="timestamp-wrapper"><span class="timestamp">[2020-12-04 Fri]</span></span>) I installed Ubuntu Mate 20.04 from a flash drive (DataStick Pro by Centon, 4GB).
</p>
<ul class="org-ul">
<li>From the installer, select <i>minimal install</i>.</li>
<li>Turn off proprietary extras
<ul class="org-ul">
<li>On my hp pavillion HPE desktop, this step was necessary or installation would fail. I'm not sure why but it might not be required in the future. Be aware.</li>
<li>I keep a partition with some terabyte of data on my desktop; be sure to install the OS to the proper partition, which should be labelled as such in the partition list.</li>
</ul></li>
<li>Click <i>Erase disk and install Ubuntu Mate</i></li>
<li>Choose your timezone and contine.</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh">&gt; NAME: ryan
&gt; COMPUTER NAME: ryan-VirtualBox
&gt; PASSWORD: 0
</pre>
</div>

<ul class="org-ul">
<li>Restart to continue.</li>
</ul>
</div>
</div>

<div id="outline-container-org09a4854" class="outline-2">
<h2 id="org09a4854">Step 2: Set up ssh / git</h2>
<div class="outline-text-2" id="text-org09a4854">
<p>
You need to set up ssh to clone the repository containing my config files. This can be done by downloading and running the script saved publicly on github:
</p>

<div class="org-src-container">
<pre class="src src-sh">&gt; wget https://ryanac23.github.io/linux/files/dclip-setup.sh
&gt; chmod +700 dclip-setup.sh
&gt; ./dclip-setup.sh
</pre>
</div>

<p>
This script will run apt to install <code>git</code> and <code>xclip</code>, one of which is necessary to clone the config repository. After setting up ssh in <code>~/.ssh</code> (by default), the contents of <code>id_rsa.pub</code> will be copies to your clipboard by <code>xclip</code>, and the GitHub homepage will open in the default browser, which is most likely <code>Firefox</code>. Sign in and add this ssh key before pressing enter as the script prompts. If done correctly, it will now clone my config files to <code>~/repos/rac_dotfiles</code>. Move to that directory to contine.
</p>

<ul class="org-ul">
<li><b>nb</b>) This is a good time to set up your global git settings.</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh">&gt; git config --global user.email [email]
&gt; git config --global user.name  [name]
</pre>
</div>
</div>

<div id="outline-container-orgcc73957" class="outline-3">
<h3 id="orgcc73957">Installed in this section:</h3>
<div class="outline-text-3" id="text-orgcc73957">
<ul class="org-ul">
<li><code>xclip</code>: Not as essential as it is convenient, this will allow you to auto copy id<sub>rsa.pub</sub> for quick ssh action. The script runs the following command:</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh">&gt; cat ~/.ssh/id_rsa.pub | xclip -selection c
</pre>
</div>

<ul class="org-ul">
<li><code>git</code>: You'll need this to get your repos!</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga5860bc" class="outline-2">
<h2 id="orga5860bc">Step 3: Install Packages</h2>
<div class="outline-text-2" id="text-orga5860bc">
<p>
To install packages with a script, navigate to <code>~/repos/rac_dotfiles/setup_docs</code>. The install script needs to be run as sudo, to loop through packages to install from <code>/rac_dotfiles/packages/*.csv</code>.
</p>
<ul class="org-ul">
<li><b>NB) If you aren't the author running this script on his personal machines, you will need to edit this script first. at the top of the document, change USER=ryan to the name of your account.</b></li>
</ul>

<div class="org-src-container">
<pre class="src src-sh">&gt; cd ~/repos/rac_dotfiles/setup_docs/
&gt; sudo ./packageinstall.sh
</pre>
</div>

<p>
This script does a number of things:
</p>
<ol class="org-ol">
<li>Checks if it's being run as root.</li>
<li>Asks if you'd like to run <code>sudo apt upgrade</code>, and does so if you confirm.</li>
<li>Asks if you'd like to run the full package install or only the core. The packages will be discussed in the next section.</li>
</ol>
<p>
3b) If <code>full</code> was selected, the <code>Google-Chrome</code> installer is also downloaded from the internet, and installed. Additionally, Dropbox will be set up. Full takes much longer than core, mostly due to the massive <code>texlive-full</code>, particularly its font files.
3c) Conda should be installed as well, but I have not added that to these scripts yet.
</p>
<ol class="org-ol">
<li>Asks if you'd like to run <code>apt upgrade</code> and <code>apt autoremove</code>, then ends the script.</li>
</ol>
</div>

<div id="outline-container-org1c65b60" class="outline-3">
<h3 id="org1c65b60">Change git and hg default editor</h3>
<div class="outline-text-3" id="text-org1c65b60">
<p>
Now that git and emacs are installed, you can configure the default editor.
</p>
<div class="org-src-container">
<pre class="src src-sh">&gt; git config --global core.editor <span style="color: #95e454;">"emacs -nw -Q</span>
<span style="color: #95e454;">                -load ~/.emacs.d/light_init.el"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd5a6ef7" class="outline-3">
<h3 id="orgd5a6ef7">Manually get Chrome</h3>
<div class="outline-text-3" id="text-orgd5a6ef7">
<p>
In case you don't want to use the script but also don't want to use a mouse:
</p>
<div class="org-src-container">
<pre class="src src-sh">&gt; wget https://dl.google.com/linux/direct/google-chrome-stable_current_amd64.deb
&gt; sudo dpkg -i google-chrome-stable_current_amd64.deb
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org49d7a78" class="outline-2">
<h2 id="org49d7a78">Step 4: Sync configuration files</h2>
<div class="outline-text-2" id="text-org49d7a78">
<p>
Now run the config script.
</p>
<div class="org-src-container">
<pre class="src src-sh">&gt; ./dotfiles_util.sh
</pre>
</div>
<p>
You should not be root (but don't worry, the script will end if you are). This script, somewhat redundantly if the previous steps have been followed, checks for the repos/dotfiles directory and clones it if it cannot be found. It then symlinks four directories to <code>$HOME</code>:
</p>
<ul class="org-ul">
<li><code>~/.emacs.d</code></li>
<li><code>~/.urxvt</code></li>
<li><code>~/bin</code></li>
<li><code>~/.guayadeque</code></li>
</ul>
<p>
It then <i>copies</i> four files to <code>$HOME</code>:
</p>
<ul class="org-ul">
<li>~/.bashrc</li>
<li>~/.bash<sub>aliases</sub></li>
<li>~/.tmux.conf</li>
<li>~/.Xresources</li>
</ul>
<p>
For the penultimate step, the repository's copy of the <code>.config</code> directory is merged with the one present at <code>$HOME</code>. This will change the gtk theme and many other settings; <b>a restart will be required for these to come into effect.</b>
</p>

<p>
Finally, the script will copy three backgrounds from Dropbox to various locations. The background in <code>/usr/share/...</code> is for the login screen, and the other two are wallpapers to be set depending on my mood or machine.
</p>
<div class="org-src-container">
<pre class="src src-sh">&gt; ~/.config/backgrounds/{desktop_wall.jpg,laptop_wall.png}
&gt; /usr/share/backgrounds/ubuntu-mate-common/login.png
</pre>
</div>

<p>
The setup is now complete.
</p>
</div>
</div>

<div id="outline-container-orgd0d54fa" class="outline-2">
<h2 id="orgd0d54fa">Extra: Old Notes</h2>
<div class="outline-text-2" id="text-orgd0d54fa">
</div>
<div id="outline-container-org028976a" class="outline-3">
<h3 id="org028976a">Nvidia screen tearing fix</h3>
<div class="outline-text-3" id="text-org028976a">
<ul class="org-ul">
<li>I had to enable line-out audio on my desktop. This may not be an issue elsewhere.</li>
<li><p>
Screen tearing with NVIDIA graphics card:
</p>
<ul class="org-ul">
<li>Open Nvidia X Server Settings &gt; X Server Display Configuration &gt; Advanced &gt;</li>
</ul>
<p>
Force Full Composition Pipeline &gt; Save to X Configuration File &gt;
    '/etc/X11/xorg.conf'; or
</p></li>
<li>nvidia-settings &#x2013;assign CurrentMetaMode="nvidia-auto-select
+0+0 { ForceFullCompositionPipeline = On }"</li>
</ul>
</div>
</div>

<div id="outline-container-org65602c3" class="outline-3">
<h3 id="org65602c3">Vim-Live-Latex-Preview</h3>
<div class="outline-text-3" id="text-org65602c3">
<p>
This gave me a live updating LaTeX environment in vim. It worked well, but I've switched to working in chunks and away from vim. If this is your work style, give it a shot:
</p>
<div class="org-src-container">
<pre class="src src-sh">&gt; sudo apt install texlive-full mupdf xdotool
<span style="color: #99968b;"># </span><span style="color: #99968b;">if Vim8, default package manager is fine</span>
&gt; cd .vim/pack/rac/start/
&gt; git clone https://github.com/ying17zi/vim-live-latex-preview.git
&gt; add ~/.vim/pack/rac/start/vim-live-latex-preview/bin to $<span style="color: #cae682;">PATH</span>
<span style="color: #99968b;"># </span><span style="color: #99968b;">vim copy register</span>
&gt; sudo apt install vim-gtk3
</pre>
</div>
<ul class="org-ul">
<li>If gvim is present (graphical vim) then a new register is unlocked. Copy to this special</li>
</ul>
<p>
register with  "+yy. After that, it should be on your main clipboard.
</p>
</div>
</div>

<div id="outline-container-org747e919" class="outline-3">
<h3 id="org747e919">Python / Miniconda</h3>
<div class="outline-text-3" id="text-org747e919">
<div class="org-src-container">
<pre class="src src-sh">&gt; mkdir ~/data/apps
&gt; cd ~/data/apps
&gt; wget <span style="color: #95e454;">"https://repo.continuum.io/miniconda/</span>
<span style="color: #95e454;">       Miniconda3-latest-Linux-x86_64.sh"</span>
&gt; bash Miniconda3-latest-Linux-x86_64.sh
</pre>
</div>

<ul class="org-ul">
<li>install in ~/data/apps/miniconda</li>
</ul>
<p>
Install minimal miniconda in base env, then make new environments for projects as necessary.
</p>

<div class="org-src-container">
<pre class="src src-sh">&gt; conda update -y conda
&gt; conda update -y --all
&gt; conda list
</pre>
</div>

<p>
Now make new environments with ipykernel, including a base jupyter environment.
The jupyter environment MUST include nb<sub>conda</sub>, and all others NEED ipykernel.
</p>
<div class="org-src-container">
<pre class="src src-sh">&gt; wget <span style="color: #95e454;">"https://anaconda.org/mforbes/jupyter/</span>
<span style="color: #95e454;">       2019.03.31.153852/download/environment.jupyter.yml"</span>
&gt; conda env create --file environment.jupyter.yml
&gt; conda create -n py3
&gt; conda activate py3
&gt; conda install ipykernel numpy matplotlib scipy
&gt; conda deactivate
</pre>
</div>
<p>
This should now give you a jupyter server environment with py3 as a kernel option.
At the end of any massive install session:
</p>

<div class="org-src-container">
<pre class="src src-sh">&gt; conda update -y conda
&gt; update -y --all
&gt; clean -p --dry-run
&gt; clean -p -y
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc315e67" class="outline-2">
<h2 id="orgc315e67">Extra: dpkg results</h2>
<div class="outline-text-2" id="text-orgc315e67">
<p>
In an ipython session:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8ac6f2; font-weight: bold;">from</span> IPython.display <span style="color: #8ac6f2; font-weight: bold;">import</span> HTML
<span style="color: #8ac6f2; font-weight: bold;">def</span> <span style="color: #cae682;">show</span>(res):
    <span style="color: #8ac6f2; font-weight: bold;">return</span> HTML(<span style="color: #95e454;">'&lt;pre style="font-size: 6pt;line-height: normal;"&gt;{</span>
<span style="color: #95e454;">        }&lt;/pre&gt;'</span>.<span style="color: #e5786d;">format</span>(<span style="color: #95e454;">"\n"</span>.join(res)))
<span style="color: #cae682;">res</span> = !dpkg -l | grep ii
show(res)
</pre>
</div>

<p>
See one of the dated links below for a comprehensive list of packages.
</p>

<ul class="org-ul">
<li><a href="dpkg-output.html">2020-12-04 Fri</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
